[
    {
        "id": "experience-zeelo",
        "section": "experiences",
        "start_year": 2024,
        "end_year": 2025,
        "company": "Zeelo",
        "country": "Espagne",
        "sector": "Solutions de Mobilité Intelligente",
        "location": "Barcelone, Espagne",
        "flag_asset": "/src/assets/svg/flag_spain.svg",
        "position": "Ingénieur Logiciel Produit Senior (Axé Front-end)",
        "period": "Mai 2024 - Juil. 2025",
        "isOngoing": false,
        "description": "Conduite collaborative de l'évolution de la plateforme d'application web en anticipant les opportunités, en assurant une qualité d'application robuste et en contribuant au développement de fonctionnalités innovantes alignées sur les tendances du secteur de la mobilité.",
        "contribuitions": [
            "Collaboration pour l'évolution de la plateforme d'application web (Place de marché pour vendre des voyages, plateforme de gestion des itinéraires).",
            "Anticiper les opportunités et assurer une qualité d'application robuste (Tests E2E et de Régression).",
            "Contribuer au développement de fonctionnalités innovantes alignées sur les tendances du secteur de la mobilité."
        ],
        "technologies": [
            "ReactJS / TypeScript / NodeJS / Zod",
            "Redux / React Query",
            "Jest / Cypress",
            "Jira / Bitbucket",
            "Sentry",
            "Storybook",
            "Git",
            "Python",
            "Figma",
            "Notion"
        ]
    },
    {
        "id": "experience-stuart",
        "section": "experiences",
        "start_year": 2020,
        "end_year": 2023,
        "company": "Stuart Delivery",
        "country": "Espagne",
        "sector": "Services Logistiques",
        "location": "Barcelone, Espagne",
        "flag_asset": "/src/assets/svg/flag_spain.svg",
        "position": "Ingénieur Solutions · Ingénieur Logiciel Full Stack",
        "period": "Oct. 2020 - Juin 2023",
        "isOngoing": false,
        "description": "Contributeur à l'élaboration de solutions technologiques qui ont optimisé l'expérience client dans la logistique du dernier kilomètre. (Back-offices pour simplifier les intégrations d'API externes, outils de surveillance et développement de la conception de produits).",
        "contribuitions": [
            "Contribution à l'élaboration de solutions technologiques qui ont optimisé l'expérience client dans la logistique du dernier kilomètre.",
            "Développement de back-offices pour simplifier les intégrations d'API externes.",
            "Implication dans le développement de la conception de produits et création d'outils de surveillance (Livraisons de chauffeurs, Activités opérationnelles)."
        ],
        "technologies": [
            "ReactJS / TypeScript / NodeJS / Sequelize",
            "React Query",
            "Jest / Enzyme / Cypress",
            "RESTful API / GraphQL",
            "MySQL / Tableau",
            "Grafana",
            "AWS / S3 / X-Ray / CloudWatch",
            "Git",
            "Jira",
            "Jenkins",
            "Figma"
        ]
    },
    {
        "id": "experience-zank-financial",
        "section": "experiences",
        "start_year": 2019,
        "end_year": 2020,
        "company": "Zank Financial",
        "country": "Espagne",
        "sector": "Services Financiers",
        "location": "Barcelone, Espagne",
        "flag_asset": "/src/assets/svg/flag_spain.svg",
        "position": "Architecte Développeur Front-end",
        "period": "Nov. 2019 - Oct. 2020",
        "isOngoing": false,
        "description": "Direction de l'architecture front-end d'une application web fintech, favorisant la conformité, l'expérience utilisateur et la fonctionnalité grâce à des intégrations (passerelle de paiement, systèmes d'e-mailing/SMS, loggers) et des améliorations suivant les exigences du produit.",
        "contribuitions": [
            "Direction de l'architecture front-end d'une application web fintech (Place de marché pour offrir et gérer des prêts).",
            "Promouvoir la conformité et améliorer l'expérience utilisateur selon les spécifications du produit.",
            "Mise en œuvre d'intégrations basées sur les exigences du produit (Passerelles de paiement, Systèmes d'e-mailing/SMS, Loggers)."
        ],
        "technologies": [
            "VueJS / NodeJS",
            "HTML5 / CSS / SASS",
            "RESTful API",
            "MySQL",
            "Trello / Slack",
            "Postman",
            "Elastic"
        ]
    },
    {
        "id": "experience-sdg-group",
        "section": "experiences",
        "start_year": 2018,
        "end_year": 2019,
        "company": "SDG Group",
        "country": "Espagne",
        "sector": "Intelligence d'Affaires et Analyse de Données",
        "location": "Barcelone, Espagne",
        "flag_asset": "/src/assets/svg/flag_spain.svg",
        "position": "Ingénieur Logiciel Front-end",
        "period": "Nov. 2018 - Oct. 2019",
        "isOngoing": false,
        "description": "Automatisation des workflows front-end et conception d'une interface utilisateur de chatbot axée sur les données avec des visualisations interactives et une application mashup de réalité augmentée pour visualiser les tendances des ventes, en exploitant les technologies web modernes et les frameworks de chatbot.",
        "contribuitions": [
            "Automatisation des workflows front-end à l'aide de technologies web modernes et de frameworks de chatbot.",
            "Conception d'une interface utilisateur de chatbot axée sur les données avec des visualisations interactives.",
            "Développement d'une application mashup de réalité augmentée (RA) pour visualiser les tendances des ventes."
        ],
        "technologies": [
            "VueJS / Angular / NodeJS",
            "HTML5 / CSS / SASS",
            "RESTful API",
            "Webpack",
            "Qlik Sense Hub",
            "Git",
            "Jira"
        ]
    },
    {
        "id": "experience-kapsch-trafficcom",
        "section": "experiences",
        "start_year": 2016,
        "end_year": 2017,
        "company": "Kapsch TrafficCom AG",
        "country": "Argentine",
        "sector": "Solutions de Transport Intelligentes",
        "location": "Buenos Aires, Argentine",
        "flag_asset": "/src/assets/svg/flag_argentina.svg",
        "position": "Développeur d'Interface Utilisateur Front-end",
        "period": "Juin 2016 - Oct. 2017",
        "isOngoing": false,
        "description": "Développement d'une plateforme de back-office web pour un système de péage à flux libre de véhicules, simplifiant la gestion de la perception des péages à travers divers aspects : Gestion des clients, Traitement des paiements, Gestion des dispositifs Tag, Surveillance des véhicules, et autres.",
        "contribuitions": [
            "Développement d'une plateforme de back-office web pour un système de péage à flux libre de véhicules.",
            "Simplification de la gestion de la perception des péages à travers divers aspects (Clients, Paiements, Surveillance des véhicules).",
            "Contribution au développement de maquettes d'API pour améliorer l'expérience développeur (DevExp)."
        ],
        "technologies": [
            "Angular / NodeJS",
            "HTML5 / CSS / SASS",
            "RESTful API / Swagger",
            "Jasper Reports",
            "SQL Server",
            "Microsoft TFS"
        ]
    },
    {
        "id": "experience-pdvsa",
        "section": "experiences",
        "start_year": 2011,
        "end_year": 2016,
        "company": "Petroleum of Venezuela (PDVSA)",
        "country": "Venezuela",
        "sector": "Énergie et Hydrocarbures",
        "location": "Caracas, Venezuela",
        "flag_asset": "/src/assets/svg/flag_venezuela.svg",
        "position": "Ingénieur Logiciel Produit (Technologies Web, Ingénierie de Données, et R+D+i)",
        "period": "Mai 2011 - Janv. 2016",
        "isOngoing": false,
        "description": "Collaboration avec des équipes interfonctionnelles pour concevoir, développer et livrer une application web en temps réel pour l'analyse de scénarios économiques, en exploitant des outils SIG et d'intelligence des données pour visualiser, analyser et modéliser des données de géoscience, financières et de production d'hydrocarbures, favorisant la prise de décision basée sur les données.",
        "contribuitions": [
            "Collaboration avec des équipes interfonctionnelles pour concevoir, développer et livrer des applications web en temps réel.",
            "Exploitation des outils SIG et d'intelligence des données pour visualiser, analyser et modéliser des données (Géoscience, Financières, Hydrocarbures).",
            "Favorisé la prise de décision basée sur les données (Production pétrolière et modèles financiers)."
        ],
        "technologies": [
            "jQuery",
            "PHP",
            "HTML5 / CSS / SASS",
            "HighCharts",
            "R Statistics",
            "Pentaho BI",
            "MySQL / PostgreSQL",
            "Adobe Creative Suite",
            "ArcGIS"
        ]
    },
    {
        "id": "experience-capem",
        "section": "experiences",
        "start_year": 2009,
        "end_year": 2011,
        "company": "Savings and Loan Association of Miranda’s Public Employees (CAPEM)",
        "country": "Venezuela",
        "sector": "Finances à but non lucratif",
        "location": "Los Teques, Venezuela",
        "flag_asset": "/src/assets/svg/flag_venezuela.svg",
        "position": "Responsable des Systèmes Informatiques",
        "period": "Nov. 2009 - Mai 2011",
        "isOngoing": false,
        "description": "Direction de la conception et du développement d'un CRM web, intégrant les départements pour améliorer la gestion du service client et conception d'un kiosque libre-service pour la gestion automatisée des files d'attente et la consultation des soldes.",
        "contribuitions": [
            "Direction de la conception et du développement d'un CRM web (Support client, surveillance des performances des employés, etc.).",
            "Intégration de divers systèmes de départements pour améliorer la gestion du service client.",
            "Conception d'un kiosque libre-service pour : gestion automatisée des files d'attente, consultation des soldes."
        ],
        "technologies": [
            "jQuery",
            "HTML5",
            "Flash Action Script 3",
            "PHP",
            "MySQL"
        ]
    }
]
