[
    {
        "id": "project-augmented-intelligence",
        "section": "projects",
        "title": "Intelligence Augmentée pour l'Analyse et la Visualisation de Données",
        "showcased_at": "Conférence Mondiale Qlik Qonnections",
        "location": "Dallas TX, USA",
        "flag": "🇺🇲",
        "flag_asset": "/src/assets/svg/flag_usa.svg",
        "project_asset": "/src/assets/images/ar_project.png",
        "owner": "© SDG Group",
        "url": "https://cdn2.hubspot.net/hubfs/4041825/SDG_Group_Augmented_Intelligence.pdf",
        "period": "Mai 2019",
        "contribute_as": "Ingénieur Logiciel Frontend",
        "technologies": [
            "VueJS / NodeJS",
            "Qlik Sense Hub",
            "SignalR Client",
            "Dialog Flow",
            "AR.js"
        ],
        "contributions": "J'ai collaboré avec des ingénieurs pour créer une expérience utilisateur RA/RM, via une application de visualisation des tendances de vente et un chatbot pour la visualisation de données.",
        "overview": "Démocratiser les données pour les rendre plus accessibles à tous, et non pas seulement aux experts. Nous utilisons la réalité mixte, la réalité augmentée et des assistants virtuels pour aider les gens à trouver des informations dans de grands ensembles de données de manière plus intuitive et conviviale.",
        "summary": "Utilisation de réalité mixte et d'assistants virtuels pour élargir l'accès aux données pour tous"
    },
    {
        "id": "project-kml-visualization",
        "section": "projects",
        "title": "Représentation de données géographiques relatives à l'Industrie Pétrolière Vénézuélienne",
        "showcased_at": "6ème Congrès de Science Cartographique",
        "location": "Buenos Aires, Argentina",
        "flag": "🇦🇷",
        "flag_asset": "/src/assets/svg/flag_argentina.svg",
        "project_asset": "/src/assets/images/kml_project.png",
        "owner": "© Pétrole du Venezuela (PDVSA)",
        "url": "https://www.ign.gob.ar/Novedades/FinalizoElSextoCongresoDeLaCienciaCartogr%C3%A1fica.",
        "period": "Juin 2012",
        "contribute_as": "Ingénieur Produit (R&D&i)",
        "technologies": [
            "Google Earth / Maps",
            "CESIUM 3D Geospatial",
            "KML / KMZ",
            "ArcGIS",
            "Global Mapper"
        ],
        "contributions": "J'ai travaillé avec des géologues et des géographes pour améliorer l'accessibilité et l'utilisabilité des données géographiques en créant et en éditant automatiquement des fichiers KML/KMZ.",
        "overview": "Faciliter l'accès aux données géographiques complexes de l'industrie pétrolière vénézuélienne (champs pétrolifères, formations géologiques et infrastructure). Le principal défi était de traiter des données souvent stockées dans des formats spécialisés, généralement accessibles uniquement avec l'utilisation de logiciels spécifiques tels qu'ArcGIS.",
        "summary": "Simplification de l'accès aux données géographiques et d'hydrocarbures pour l'industrie pétrolière vénézuélienne"
    },
    {
        "id": "project-opportunity-portfolios-sipo",
        "section": "projects",
        "title": "Système Intégré de Portefeuilles d'Opportunités (SIPO)",
        "showcased_at": "Association Américaine des Géologues du Pétrole (AAPG)",
        "location": "Houston TX, USA",
        "flag": "🇺🇲",
        "flag_asset": "/src/assets/svg/flag_usa.svg",
        "project_asset": "/src/assets/images/sipo_project.png",
        "owner": "© Pétrole du Venezuela (PDVSA)",
        "url": "https://www.searchanddiscovery.com/pdfz/documents/2011/40798garcia/ndx_garcia.pdf.html",
        "period": "Août 2011",
        "contribute_as": "Développeur Logiciel · Ingénierie de Données",
        "technologies": [
            "HTML5 / jQuery / CSS",
            "PHP",
            "MySQL / PostgreSQL",
            "HighCharts",
            "R Statistics",
            "ETL / DWH",
            "Pentaho BI",
            "ArcGIS"
        ],
        "contributions": "Je me suis associé à une équipe d'ingénieurs, d'économistes, de géologues et de géographes pour créer et lancer une application Web en temps réel afin de faciliter l'analyse de scénarios économiques et de visualiser efficacement les données géoscientifiques et financières.",
        "overview": "SIPO est un système Web qui fournit des informations en temps réel pour l'industrie pétrolière. Il est conçu pour soutenir la prise de décision en éliminant les données redondantes. L'application utilise la visualisation de données pour l'analyse économique et l'API Google Earth pour les données géographiques/géologiques.",
        "summary": "Système Web pour l'industrie pétrolière utilisant des données en temps réel pour faciliter la prise de décision"
    }
]
