[
    {
        "id": "project-augmented-intelligence",
        "section": "projects",
        "title": "An谩lisis Inteligente y Visualizaci贸n de Datos con y Realidad Aumentada",
        "showcased_at": "Conferencia Global Qlik Qonnections",
        "location": "Dallas TX, USA",
        "flag": "吼",
        "flag_asset": "/src/assets/svg/flag_usa.svg",
        "project_asset": "/src/assets/images/ar_project.png",
        "owner": "漏 SDG Group",
        "url": "https://cdn2.hubspot.net/hubfs/4041825/SDG_Group_Augmented_Intelligence.pdf",
        "period": "Mayo 2019",
        "contribute_as": "Ingeniero de Software Frontend",
        "technologies": [
            "VueJS / NodeJS",
            "Qlik Sense Hub",
            "SignalR Client",
            "Dialog Flow",
            "AR.js"
        ],
        "contributions": "Colabor茅 con ingenieros para crear una experiencia de usuario de RA/RM, a trav茅s de una aplicaci贸n para visualizar tendencias de ventas y un chatbot para la visualizaci贸n de datos.",
        "overview": "Democratizar los datos para hacerlos m谩s accesibles para todos, no solo para los expertos en datos. Utilizamos realidad mixta, realidad aumentada y asistentes virtuales para ayudar a las personas a encontrar informaci贸n en grandes conjuntos de datos de una manera m谩s intuitiva y f谩cil de usar.",
        "summary": "Uso de la realidad mixta y de asistentes virtuales para ampliar el acceso a los datos para todos"
    },
    {
        "id": "project-kml-visualization",
        "section": "projects",
        "title": "Representaci贸n de datos geogr谩ficos relacionados con la Industria Petrolera Venezolana",
        "showcased_at": "6to Congreso de Ciencia Cartogr谩fica",
        "location": "Buenos Aires, Argentina",
        "flag": "",
        "flag_asset": "/src/assets/svg/flag_argentina.svg",
        "project_asset": "/src/assets/images/kml_project.png",
        "owner": "漏 Petr贸leos de Venezuela (PDVSA)",
        "url": "https://www.ign.gob.ar/Novedades/FinalizoElSextoCongresoDeLaCienciaCartogr%C3%A1fica.",
        "period": "Junio 2012",
        "contribute_as": "Ingeniero de Producto (I+D+i)",
        "technologies": [
            "Google Earth / Maps",
            "CESIUM 3D Geospatial",
            "KML / KMZ",
            "ArcGIS",
            "Global Mapper"
        ],
        "contributions": "Trabaj茅 junto a ge贸logos y ge贸grafos para mejorar la accesibilidad y usabilidad de los datos geogr谩ficos mediante la creaci贸n y edici贸n autom谩tica de archivos KML/KMZ.",
        "overview": "Facilitar el acceso a datos geogr谩ficos complejos de la industria petrolera venezolana (campos petroleros, formaciones geol贸gicas e infraestructura). El principal desaf铆o fue procesar datos almacenados a menudo en formatos especializados; que suelen estar disponibles con el uso de software espec铆fico como ArcGIS.",
        "summary": "Simplificando el acceso a datos geogr谩ficos y de hidrocarburos para la industria petrolera venezolana"
    },
    {
        "id": "project-opportunity-portfolios-sipo",
        "section": "projects",
        "title": "Sistema Integrado de Portafolios de Oportunidades (SIPO)",
        "showcased_at": "Asociaci贸n Americana de Ge贸logos del Petr贸leo (AAPG)",
        "location": "Houston TX, USA",
        "flag": "吼",
        "flag_asset": "/src/assets/svg/flag_usa.svg",
        "project_asset": "/src/assets/images/sipo_project.png",
        "owner": "漏 Petr贸leos de Venezuela (PDVSA)",
        "url": "https://www.searchanddiscovery.com/pdfz/documents/2011/40798garcia/ndx_garcia.pdf.html",
        "period": "Agosto 2011",
        "contribute_as": "Desarrollador de Software 路 Ingenier铆a de Datos",
        "technologies": [
            "HTML5 / jQuery / CSS",
            "PHP",
            "MySQL / PostgreSQL",
            "HighCharts",
            "R Statistics",
            "ETL / DWH",
            "Pentaho BI",
            "ArcGIS"
        ],
        "contributions": "Me asoci茅 con un equipo de ingenieros, economistas, ge贸logos y ge贸grafos para crear y lanzar una aplicaci贸n web en tiempo real para facilitar el an谩lisis de escenarios econ贸micos y visualizar de manera efectiva datos geocient铆ficos y financieros.",
        "overview": "SIPO es un sistema basado en web que proporciona informaci贸n en tiempo real para la industria petrolera. Est谩 dise帽ado para apoyar la toma de decisiones eliminando datos redundantes. La aplicaci贸n utiliza visualizaci贸n de datos para el an谩lisis econ贸mico y la API de Google Earth para datos geogr谩ficos / geol贸gicos.",
        "summary": "Sistema basado en web para la industria petrolera que utiliza datos en tiempo real para ayudar en la toma de decisiones"
    }
]
